Repository: moridaffy/habitude
Catalog: habitude/Resources/*.lproj/Localizable.strings
Languages: ru

source: Please, create a new habit using the + icon in the top right corner of the screen!
ru: Пожалуйста, создай новую привычку при помощи кнопки + в правом верхнем углу экрана!

source: What do you want to do with selected habit?
ru: Что ты хочешь сделать с выбранной привычкой?

source: Delete habit
ru: Удалить привычку

source: Habit's name
ru: Название привычки

source: Habit's icon
ru: Иконка привычки

source: Habit's color
ru: Цвет привычки

source: Habit's type
ru: Тип привычки

source: Create
ru: Создать

source: Deactivate
ru: Деактивировать

source: Activate
ru: Активировать

source: Types of habits
ru: Типы привычек

source: Negative
ru: Негативная

source: Positive
ru: Позитивная

source: Your habit was successfully created!
ru: Привычка была успешно создана!

source: Done
ru: Готово

source: Error
ru: Ошибка

source: Error description
ru: Описание ошибки

source: An unknown error has occurred
ru: Произошла неизвестная ошибка

source: Theme
ru: Оформление

source: Automatic
ru: Автоматически

source: Dark
ru: Темное

source: Light
ru: Светлое

source: Amount of habits on app's icon
ru: Кол-во привычек на бейдже иконки

source: Nonactivated
ru: Неактивированные

source: Activated
ru: Активированые

source: None
ru: Никакие

source: About
ru: О приложении

source: Github repository
ru: Github репозиторий

source: My website
ru: Мой сайт

source: Rate in App Store
ru: Оценка в App Store

# HabitCreationViewController.Instructions
source: Choose an icon and color for a new habit, enter its name (or use a template), select its type and click the "Create" button
ru: Выбери иконку и цвет для новой привычки, укажи ее имя (или используй заготовку), выбери ее тип и нажми на кнопку "Создать"

# HabitCreationViewModel.HabitTypeAlertBodyText
source: There are two types of habits in this app: positive and negative. Positive habits are regular habits which have to be completed everyday. For example, drink 1l of water, go to gym and so on. Negative habits are habits, which are automatically activated in the start of your day and must be deactivated if you fail to restrict yourself from doing something. For example, don't smoke, don't drink milk and so on.
ru: Существуют два типа привычек в этом приложении: позитивные и негативные Позитивные привычки - привычки, которые надо выполнять каждый день. Например, выпить 1л воды, сходить в спортзал и так далее Негативные привычки - привычки, которые автоматически активируются в начале каждого дня и должны быть деактивированы, если ты не сможешь воздержаться от какого-то действия. Например, не курить, не пить молоко и так далее

# SettingsViewController.ThemeChanged
source: Theme changed. Please, relaunch the app for the changes to take effect correctly.
ru: Оформление изменено. Пожалуйста, перезапусти приложение, чтобы изменения вступили в силу корректно.

# SettingsViewController.ErrorSettingBadge
source: Unable to set badge value. Please, check app's permissions in system settings app and try again
ru: Не удалось установить значение бейджика на иконке приложения. Пожалуйста, проверь доступ Habitude к отправке уведомлений при помощи стандартного приложения настроек и попробуй еще раз

# SettingsViewModel.AboutAlertBodyText
source: Thank you for downloading my simple app for creating positive habits and getting rid of negative ones. I hope that you are already trying to upgrade to a better version of yourself with the help of Habitude. My name is Maxim Skryabin, I'm an iOS developer of this and several other apps in the Apple App Store. You can check them out on my website (although it's fully in Russian at the moment). Please, feel free to contact me using my email, App Store reviews or my website. PS: This app is opensourced (v1.0) so it's source code can be downloaded from Github repository. It's nothing fancy so I don't know why would you even want to download or fork it, but you have an option to do so. PPS: If you found this app a tiny bit useful, please leave a review in the App Store, it really helps a lot :)
ru: Спасибо за загрузку моего простого приложения для формирования полезных привычек и избавления от вредных. Надеюсь, что ты уже пытаешься прокачаться до лучшей версии себя при помощи Habitude. Меня зовут Максим Скрябин, я являюсь iOS разработчиком этого и еще нескольких других приложений в App Store. Ты можешь ознакомиться с ними на моем сайте. Со мной также можно связаться при помощи email'a, отзывов в App Store и форме связи на моем сайте. PS: Исходный код этого приложения (v1.0) доступен на Github репозитори. Там нет ничего супер крутого, так что я не знаю зачем тебе может захотеться скачать/форкнуть этот проект. Но если вдруг захочется - такая возможность у тебя есть. PPS: Если это приложение было хоть немного полезным для тебя, то, пожалуйста, поставь оценку в App Store, это сильно помогает:)

source: Drink 1l of water
ru: Выпить 1л воды

source: Clean your teeth
ru: Почистить зубы

source: Meditate
ru: Медитировать

source: Don't eat junk food
ru: Не есть вредную пищу

source: Don't drink milk
ru: Не пить молоко

source: Read a book
ru: Почитать книгу

source: Take pills
ru: Принять лекарства

source: Wake up early
ru: Проснуться рано

source: Eat healthy food
ru: Есть полезную пищу

source: Play musical instrument
ru: Поиграть на муз. инструменте

source: Feed your dog
ru: Покормить собаку

source: Feed your cat
ru: Покормить кошку

source: Clean up
ru: Навести порядок

source: Don't drink alcohol
ru: Не пить алкоголь

source: Go to gym
ru: Сходить в спортзал

source: Don't drink coffee
ru: Не пить кофе
